WS_SOAP_Client/src/main/java/com/pg/util/io/HelloSecure_Req.xml

<?xml version="1.0"  standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Body>
		<ns2:getUserDetails xmlns:ns2="http://hellosecure.secure.service.ws.pg.com/">
			<arg0>Pradhap</arg0>
		</ns2:getUserDetails>
	</S:Body>
</S:Envelope>